Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: A start tag can define parameters with optional names, e.g. `{#if item.isActive}` and `{#let foo=1 bar=false}`. Parameters are separated by one or more spaces. Names are separated from the values by the equals sign. Names and values can be prefixed and suffixed with any number of spaces, e.g. `{#let id='Foo'}` and `{#let id = 'Foo'}` are equivalents where the name of the parameter is `id` and the value is `Foo`. Values can be grouped using parentheses, e.g. `{#let id=(item.id ?: 42)}` where the name is `id` and the value is `item.id ?: 42`. Sections can interpret parameter values in any way, e.g. take the value as is. However, in most cases, the parameter value is registered as an <<expressions,expression>> and evaluated before use.
ja_jp: 開始タグはオプションの名前を持つパラメーターを定義できます (例: `{#if item.isActive}`、 `{#let foo=1 bar=false}`)。 パラメーターは 1 つ以上のスペースで区切られます。 名前は、統合により値と区切られます。 名前と値には、任意の数のスペースを接頭辞と接尾辞として追加できます。たとえば `{#let id='Foo'}` と `{#let id = 'Foo'}` は、パラメーター名が `id` で値が `Foo` である点で同等です。 値は括弧を使用してグループ化できます。たとえば `{#let id=(item.id ?: 42)}` は、名前が `id`、値は `item.id ?: 42` です。 セクションはパラメーター値を任意の方法で (たとえば値をそのまま) 解釈できます。 しかし、ほとんどの場合、パラメーター値は <<expressions,expression>> として登録され、使用前に評価されます。

source: A start tag can define parameters with optional names, e.g. `{#if item.isActive}` and `{#let foo=1 bar=false}`. Parameters are separated by one or more whitespaces. Names are separated from the values by the equals sign. Names and values can be prefixed and suffixed with any number of spaces, e.g. `{#let id='Foo'}` and `{#let id = 'Foo'}` are equivalents where the name of the parameter is `id` and the value is `Foo`. Values can be grouped using parentheses, e.g. `{#let id=(item.id ?: 42)}` where the name is `id` and the value is `item.id ?: 42`. Sections can interpret parameter values in any way, e.g. take the value as is. However, in most cases, the parameter value is registered as an <<expressions,expression>> and evaluated before use.
ja_jp: 開始タグは、オプションの名前を持つパラメーターを定義できます (例: `{#if item.isActive}` および `{#let foo=1 bar=false}`)。パラメーターは 1 つ以上の空白で区切られます。名前は等号によって値と区切られます。名前と値には、任意の数の空白を接頭辞および接尾辞として追加できます (例: `{#let id='Foo'}` と `{#let id = 'Foo'}` は、パラメーター名が `id` で値が `Foo` である点で同等です)。値は括弧を使用してグループ化できます (例: `{#let id=(item.id ?: 42)}` は、名前が `id` で値が `item.id ?: 42` です)。セクションはパラメーター値を任意の方法で (たとえば値をそのまま) 解釈できます。しかし、ほとんどの場合、パラメーター値は <<expressions,式>> として登録され、使用前に評価されます。

source: A starter template has been generated for both JVM and native execution modes.
ja_jp: JVMとネイティブ実行モードの両方に対応したスターターテンプレートが生成されています。

source: A static template extension method can be used to add "computed properties" to a data class. The class of the first parameter is used to match the base object and the method name is used to match the property name.
ja_jp: 静的テンプレート拡張メソッドを使用して、データクラスに「計算プロパティー」を追加することができます。最初のパラメーターのクラスはベースオブジェクトと一致するように使用され、メソッド名はプロパティー名と一致するように使用されます。

source: A string - written into the HTTP response directly.
ja_jp: 文字列 - HTTP レスポンスに直接書き込まれます

source: A student can attend at most one lesson at the same time.
ja_jp: 生徒は同時に最大 1 つのレッスンに参加できます。

source: A student dislikes sequential lessons on the same subject.
ja_jp: 生徒は連続して同じテーマのレッスンに出席することを嫌います。

source: A subclass never inherits the metadata of a `@Scheduled` method declared on a superclass. For example, suppose the class `org.amce.Foo` is extended by the class `org.amce.Bar`. If `Foo` declares a non-static method annotated with `@Scheduled` then `Bar` does not inherit the metadata of the scheduled method. In the following example, the `everySecond()` method is only invoked upon the instance of `Foo`.
ja_jp: サブクラスは、スーパークラスで宣言された `@Scheduled` メソッドのメタデータを継承しません。 たとえば、クラス `org.amce.Foo` がクラス `org.amce.Bar` によって拡張されているとします。 `Foo` が `@Scheduled` アノテーションが付けられた非静的メソッドを宣言する場合、 `Bar` はスケジュールされたメソッドのメタデータを継承しません。 次の例では、 `everySecond()` メソッドは `Foo` のインスタンスに対してのみ呼び出されます。

source: A super responsive and helpful https://quarkus.io/community[community^], especially the core developers
ja_jp: 特にコア・デベロッパーを中心とした、反応の良い親切な https://quarkus.io/community[コミュニティ^]

source: A supported operating system or an Open Container Initiative (OCI) compatible container runtime, such as Podman or Docker.
ja_jp: サポートされているオペレーティングシステム、または Podman や Docker など、Open Container Initiative (OCI) 互換のコンテナーランタイム。

source: A suppression list may vary depending on whether you'd like to keep checking the false positives to avoid missing something or not. For example, it can look like this:
ja_jp: 抑制リストは、何かを見落とさないために偽陽性をチェックし続けたいか、そうでないかによって変わってきます。例えば、以下のようになります：

source: A synthetic bean may register a synthetic injection point via the `ExtendedBeanConfigurator#addInjectionPoint()` method. This injection point is validated at build time and considered when <<cdi-reference.adoc#remove_unused_beans,detecting unused beans>>. The injected reference is accessible through the `SyntheticCreationalContext#getInjectedReference()` methods at runtime.
ja_jp: 合成 Bean は、 `ExtendedBeanConfigurator#addInjectionPoint()` メソッドを介して合成注入ポイントを登録できます。 この注入ポイントはビルド時に検証され、<<cdi-reference.adoc#remove_unused_beans,detecting unused beans>> で検討されます。 注入された参照は、実行時に `SyntheticCreationalContext#getInjectedReference()` メソッドを通じてアクセスできます。

source: A synthetic injection point with required type `Bar` was added; this is an equivalent of `@Inject Bar`.
ja_jp: 必須の `Bar` 型の合成注入ポイントが追加されました。これは `@Inject Bar` と同じです。

source: A system property that will be set at native executable build time.
ja_jp: ネイティブ実行可能ファイルのビルド時に設定されるシステムプロパティです。

source: A tag can be registered manually via `Engine.builder().addSectionHelper(new UserTagSectionHelper.Factory("tagName","tagTemplate.html")).build()`
ja_jp: タグは、`Engine.builder().addSectionHelper(new UserTagSectionHelper.Factory("tagName","tagTemplate.html")).build()` を介して手動で登録することができます。

source: A teacher can teach at most one lesson at the same time.
ja_jp: 教師は同時に最大 1 つのレッスンを教えることができます。

source: A teacher prefers to teach all lessons in the same room.
ja_jp: 教師はすべてのレッスンを同じ教室で教えることを好みます。

source: A teacher prefers to teach sequential lessons and dislikes gaps between lessons.
ja_jp: 教師は連続してレッスンを教えることを好み、レッスン間に空き時間があることを嫌います。

source: A template can be either registered manually or automatically via a template locator. The locators are used whenever the `Engine.getTemplate()` method is called, and the engine has no template for a given id stored in the cache. The locator is responsible for using the correct character encoding when reading the contents of a template.
ja_jp: テンプレートは、手動で登録するか、テンプレートロケータを介して自動的に登録することができます。ロケーターは、 `Engine.getTemplate()` メソッドが呼び出されたときに、エンジンがキャッシュに保存している所定の ID のテンプレートがない場合に使用されます。ロケーターは、テンプレートの内容を読み取る際に、正しい文字エンコーディングを使用する責任があります。

source: A template can be either registered manually or automatically via a template locator. The locators are used whenever the `Engine.getTemplate()` method is called and the engine has no template for a given id stored in the cache. The locator is responsible to use the correct character encoding when reading the contents of a template.
ja_jp: テンプレートは手動で登録することも、テンプレートロケーターを介して自動的に登録することもできます。ロケーターは `Engine.getTemplate()` メソッドが呼び出され、エンジンに特定の ID のテンプレートがキャッシュに保存されていない場合に使用されます。ロケーターはテンプレートの内容を読み込む際に、正しい文字エンコーディングを使用する必要があります。

source: A template extension method:
ja_jp: テンプレート拡張メソッド:

source: A template identifier that contains a dollar sign `$` denotes a fragment. The `item$item_aliases` value is translated as: _Use the fragment `item_aliases` from the template `item`._
ja_jp: ドル記号 `$` を含むテンプレート識別子は、フラグメントを表します。 `item$item_aliases` の値は、次のように訳されます。_テンプレート `item` からフラグメント `item_aliases` を使用します。_

source: A template named `bar.html` is located by the custom locator at runtime.
ja_jp: 実行時に、カスタムロケーターによって `bar.html` という名前のテンプレートが配置されます。

source: A template record that is not annotated with `@CheckedTemplate` is treated as if it was annotated with `@CheckedTemplate` with default values.
ja_jp: `@CheckedTemplate` でアノテーションが付けられていないテンプレートレコードは、デフォルト値で `@CheckedTemplate` でアノテーションが付けられているものとして扱われます。

source: A test that runs with authorization disabled can just set the enabled property to false:
ja_jp: 認可を無効にして実行されるテストは、enabled プロパティーを false に設定するだけです。

source: A tested value that resolves to an enum is handled specifically. The parameters of an `is`/`case` block are not evaluated as expressions but compared with the result of `toString()` invocation upon the tested value.
ja_jp: enum に解決されるテスト値は特別な扱いを受けます。 `is` / `case` ブロックのパラメーターは式として評価されるのではなく、テストされた値に対して `toString()` を呼び出した結果と比較されます。

source: A third Quarkus extension for the "high level REST Client" used to exist, but was removed as this client has been deprecated by Elastic and has some licensing issues.
ja_jp: 以前は「ハイレベルRESTクライアント」用の3つ目のQuarkusエクステンションが存在しましたが、このクライアントはElasticによって非推奨とされ、ライセンス上の問題があるため削除されました。

source: A third, and final observation, is that if you capture the `syscalls:sys_enter_munmmap` event, you might observe that some allocations also result in calls to `munmap`. When calculating the size to reserve, the requested size to allocate can be rounded up to the page size. The maintain alignment, 1MB in case of aligned chunks or 1 byte for unaligned chunks, some of the reserved memory might be unreserved. That is where these `munmap` calls would come from.
ja_jp: 3 番目で最後に、 `syscalls:sys_enter_munmmap`イベントをキャプチャーすると、 割り当てによって `munmap` の呼び出しも発生することが確認できます。 確保するサイズを計算する場合、 割り当てる要求されたサイズはページサイズに切り上げることができます。 維持アライメント、 整列チャンクの場合は 1MB、整列していないチャンクの場合は 1 バイトで、 予約されたメモリーの一部が予約されていない可能性があります。 そこからこれらの `munmap` 呼び出しが行われます。

source: A time slot has no date, because a high school schedule just repeats every week. So there is no need for https://docs.optaplanner.org/latestFinal/optaplanner-docs/html_single/index.html#continuousPlanning[continuous planning].
ja_jp: 高校の時間割は毎週同じものが繰り返されるため、タイムスロットに日付はありません。したがって、 https://docs.optaplanner.org/latestFinal/optaplanner-docs/html_single/index.html#continuousPlanning[継続的な計画作成] は必要ありません。

source: A token is acquired from Keycloak by using a `password` grant and is sent to the service endpoint.
ja_jp: トークンは `password` グラントを使用して Keycloak から取得され、サービスエンドポイントに送信されます。

source: A token is acquired from Keycloak using a `password` grant and is sent to the service endpoint.
ja_jp: トークンは `password` グラントを使用して Keycloak から取得され、サービスエンドポイントに送信されます。

source: A tool corresponds to a method that a client can call. Any JSON‑RPC method can be exposed as a tool by supplying descriptions on the method and its parameters. Tools can run on either the runtime or deployment classpath.
ja_jp: ツールは、クライアントが呼び出すことができるメソッドに対応します。メソッドとそのパラメーターに説明を指定することで、任意の JSON‑RPC メソッドをツールとして公開できます。ツールはランタイムまたはデプロイメントのクラスパスのいずれかで実行できます。

source: A traditional CDI container attempts to find all beans during the application bootstrap. For each bean a metadata object is created and kept for the lifetime of the application. This allows for certain degree of dynamicity at runtime but it's suboptimal when it comes to memory consumption and application startup time. Quarkus, on the other hand, attempts to detect and remove all _unused_ beans, interceptors and decorators during build by default. And the reason is simple. This optimization helps to minimize the amount of generated classes and the number of metadata objects used at runtime, thus conserving memory.
ja_jp: 従来のCDIコンテナは、アプリケーションのブートストラップ時にすべてのBeanを見つけようとします。各Beanに対して、メタデータオブジェクトが作成され、アプリケーションの寿命まで保持されます。これにより、ランタイムにある程度の動的性を持たせることができますが、メモリ消費やアプリケーションの起動時間に関しては最適ではありません。一方、Quarkusは、デフォルトでビルド時に _未使用の_ Bean、Interceptor、Decoratorをすべて検出して削除しようとします。その理由は簡単です。この最適化により、生成されるクラスの量と実行時に使用されるメタデータオブジェクトの数を最小限に抑え、メモリを節約することができます。

source: A trigger is defined either by the `@Scheduled#cron()` or by the `@Scheduled#every()` attribute. If both are specified, the cron expression takes precedence. If none is specified, the build fails with an `IllegalStateException`.
ja_jp: トリガーは、 `@Scheduled#cron()` 属性または `@Scheduled#every()` 属性によって定義されます。両方が指定されている場合、cron 式が優先されます。何も指定されていない場合、ビルドは `IllegalStateException` で失敗します。

source: A trigger is defined either by the `@Scheduled#cron()` or by the `@Scheduled#every()` attributes. If both are specified, the cron expression takes precedence. If none is specified, the build fails with an `IllegalStateException`.
ja_jp: トリガーは、 `@Scheduled#cron()` 属性または `@Scheduled#every()` 属性によって定義されます。両方が指定されている場合、cron 式が優先されます。何も指定されていない場合、ビルドは `IllegalStateException` で失敗します。

source: A typical Java application uses JIT (Just in time) compilation. When an application starts up, it needs time for specific warm-up code paths to perform better, which means additional CPU cycles for warm-up times. Cloud-native applications demand a faster startup time. Ahead-of-time (AOT) compilation enables that by doing most of the optimizations at build time. A good example here is Quarkus. As a result, we have full speed from startup and no CPU overhead for compilations at startup time. Quarkus application initialization has two phases: static initialization and runtime initialization. This distinction follows the principles of the GraalVM native compilation, inlining the static initialization in the resulting executable, while the runtime initialization happens during the regular execution. We compared multiple functions to understand the benefits of each feature we added:
ja_jp: 典型的なJavaアプリケーションでは、JIT（Just in time）コンパイルが使用されています。アプリケーションの起動時には、特定のウォームアップコードパスがより良いパフォーマンスを発揮するための時間が必要で、これはウォームアップ時間のための追加のCPUサイクルを意味します。クラウド・ネイティブ・アプリケーションは、より高速な起動時間を要求します。AOT（Ahead-of-Time）コンパイルは、ビルド時に最適化のほとんどを行うことで、これを可能にします。その好例がQuarkusです。その結果、起動時からフルスピードで、起動時のコンパイルにかかるCPUオーバーヘッドもありません。Quarkusのアプリケーション初期化には、静的初期化と実行時初期化という2つのフェーズがあります。この区別は、GraalVMのネイティブコンパイルの原則に従っており、静的初期化は結果の実行可能ファイルにインライン化し、実行時初期化は通常の実行中に行われます。我々は、追加した各機能の利点を理解するために、複数の関数を比較しました:

source: A typical configuration with several connections would look like:
ja_jp: 複数の接続がある典型的な構成は、次のようになります:

source: A typical configuration with several datasources would look like:
ja_jp: 複数のデータソースを使用した典型的な構成は以下のようになります。

source: A typical day now:
ja_jp: 現在の典型的な一日:

source: A typical example of a conditional dependency would be a component that should be added to the classpath **only** in case all of its required dependencies are present on the classpath. If one or more of the component's required dependencies aren't available, instead of failing, the component should simply not be added.
ja_jp: 条件付き依存関係の典型的な例としては、必要な依存関係がすべてクラスパスに存在する場合に**のみ**、クラスパスに追加する必要があるコンポーネントが挙げられます。コンポーネントの必要な依存関係の 1 つ以上が利用できない場合は、失敗するのではなく、コンポーネントを追加しないようにする必要があります。

source: A typical use of `@JsonView` is to hide certain fields on certain methods. In that vein, let's define two views:
ja_jp: `@JsonView` の一般的な使用法は、特定のメソッドの特定のフィールドを非表示にすることです。その流れの中で、2 つのビューを定義しましょう。

source: A unique default cache key derived from the cache name is used because the method has no arguments.
ja_jp: メソッドには引数がないため、キャッシュ名から派生した一意のデフォルトキャッシュキーが使用されます。

source: A unique experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
ja_jp: Kubernetes の世界で Java の使用を開始するのに役立つように設計された、Quarkus エキスパートにアクセスできるユニークな体験を提供します。

source: A unique string that identifies the consumer group the application belongs to. If not set, defaults to the application name as set by the `quarkus.application.name` configuration property. If that is not set either, a unique, generated id is used. It is recommended to always define a `group.id`, the automatic generation is only a convenient feature for development. You can explicitly ask for automatically generated unique id by setting this property to `${quarkus.uuid}`. Type: _string_
ja_jp: アプリケーションが所属するコンシューマーグループを識別するための一意の文字列。 設定されていない場合、デフォルトでは、 `quarkus.application.name` 設定プロパティで設定されたアプリケーション名になります。 それも設定されていない場合は、生成された一意のIDが使用されます。 常に `group.id` を定義することをお勧めします。自動生成は、開発用の便利機能にすぎません。 このプロパティを `${quarkus.uuid}` に設定することで、自動的に生成される一意の ID を明示的に要求することができます。 Type: _string_

source: A user may choose to disable all the Java options provided by extensions by configuring `disableAll` parameter such as
ja_jp: ユーザーは、以下のような `disableAll` パラメーターを設定することで、エクステンションが提供するすべての Java オプションを無効にできます。

source: A valid template file name is a sequence of non-whitespace characters. For example, a template file named `foo and bar.html` will be ignored.
ja_jp: 有効なテンプレートファイル名は、空白以外の文字のシーケンスです。たとえば、名前が `foo and bar.html` のテンプレートファイルは無視されます。

source: A value for the given station id was found, so that value will be returned
ja_jp: 指定された station id の値が見つかったので、その値が返されます

source: A value less than one second may not be supported by the underlying scheduler implementation. In that case a warning message is logged during build and application start.
ja_jp: 1 秒未満の値は、基盤となるスケジューラー実装ではサポートされていない可能性があります。その場合、ビルドおよびアプリケーションの起動時に警告メッセージが記録されます。

source: A value resolver is automatically generated for a method annotated with `@TemplateExtension`. If a class is annotated with `@TemplateExtension` then a value resolver is generated for every _non-private static method_ declared on the class. Method-level annotations override the behavior defined on the class. Methods that do not meet the following requirements are ignored.
ja_jp: 値リゾルバは、 `@TemplateExtension` でアノテーションされたメソッドに対して自動的に生成されます。クラスが `@TemplateExtension` でアノテーションされている場合、そのクラスで宣言されている _プライベートではないスタティック・メソッド_ ごとに値リゾルバが生成されます。メソッドレベルのアノテーションは、クラスで定義された動作をオーバーライドします。以下の要件を満たさないメソッドは無視されます。

source: A value resolver is automatically generated for a type annotated with `@TemplateData`. This allows Quarkus to avoid using reflection to access the data at runtime.
ja_jp: 値リゾルバは、 `@TemplateData` でアノテーションされた型に対して自動的に生成されます。これにより、Quarkusでは、実行時にデータにアクセスするためのリフレクションの使用を避けることができます。

source: A value resolver is automatically generated for all types used in parameter declarations so that it's possible to access its properties without reflection.
ja_jp: パラメーター宣言で使用されるすべての型に対して値リゾルバが自動的に生成され、そのプロパティーにリフレクションなしでアクセスできるようになります。

source: A variety of Quarkus extensions are being utilized in the application including:
ja_jp: このアプリケーションでは、以下のような様々なQuarkusのエクステンションが利用されています。

source: A version of https://github.com/iovisor/bcc[bcc]/ https://ebpf.io/[eBPF] that can do stack traces is only available from Linux kernel 4.8 onwards. It can do in-kernel summaries, which makes it more efficient and has lower overhead. Unfortunately it doesn't understand DWARF debug symbols, so the information obtained might be harder to read and contain less detail.
ja_jp: スタックトレースができるバージョンの link:https://github.com/iovisor/bcc[bcc/] link:https://ebpf.io/[eBPF] は、Linuxカーネル4.8以降でのみ利用可能です。カーネル内サマリーを行うことができるため、より効率的でオーバーヘッドが少なくなっています。しかし、DWARFデバッグシンボルを理解できないため、得られる情報は読みづらく、詳細な情報が含まれていない可能性があります。

source: A very common need is to start some services on which your Quarkus application depends, before the Quarkus application starts for testing. To address this need, Quarkus provides `@io.quarkus.test.common.QuarkusTestResource` and `io.quarkus.test.common.QuarkusTestResourceLifecycleManager`.
ja_jp: 非常に一般的なニーズとして、Quarkus アプリケーションをテスト用に起動する前に、Quarkus アプリケーションが依存するいくつかのサービスを起動することが挙げられます。このニーズに対応するために、Quarkusでは、 `@io.quarkus.test.common.QuarkusTestResource` と `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` を提供します。

source: A very common use case is to deploy a Quarkus application that needs to access a relational database which has itself already been deployed on Kubernetes. Using the `quarkus-kubernetes-config` extension makes this use case very simple to handle.
ja_jp: 非常に一般的なユースケースは、それ自体がすでにKubernetesにデプロイされているリレーショナルデータベースにアクセスする必要があるQuarkusアプリケーションをデプロイすることです。 `quarkus-kubernetes-config` エクステンションを使用することで、このユースケースを非常に簡単に扱うことができます。

source: A very easy way to accomplish that is by using the following Docker command:
ja_jp: それを実現する非常に簡単な方法は、以下のDockerコマンドを使用することです。

source: A very interesting trait of Kafka Streams applications is that they can be scaled out, i.e. the load and state can be distributed amongst multiple application instances running the same pipeline. Each node will then contain a subset of the aggregation results, but Kafka Streams provides you with https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html#querying-remote-state-stores-for-the-entire-app[an API] to obtain the information which node is hosting a given key. The application can then either fetch the data directly from the other instance, or simply point the client to the location of that other node.
ja_jp: Kafka Streams の非常に興味深い特性は、それらがスケールアウト可能であるということです。つまり、同じパイプラインを実行している複数のアプリケーションインスタンス間で負荷や状態を分散させることができます。各ノードには集約結果のサブセットが含まれますが、Kafka Streams は与えられたキーをホストしているノードの情報を取得するための link:https://kafka.apache.org/22/documentation/streams/developer-guide/interactive-queries.html#querying-remote-state-stores-for-the-entire-app[API] を提供しています。アプリケーションは、他のインスタンスから直接データを取得するか、クライアントにその他のノードの場所を指定するだけです。

source: A very large REST CRUD application: 1,000 entities, 1,000 repositories, 1,000 services, 1,000 REST endpoints... `9,000` .java files in total. This is an extreme case, don't try this at home!
ja_jp: 非常に大規模な REST CRUD アプリケーション: 1,000 エンティティー、1,000 リポジトリー、1,000 サービス、1,000 REST エンドポイント... 合計で `9,000` 個の .java ファイル。これは極端なケースなので、自宅では試さないでください！

source: A very simple JAX-RS Resource that uses `Person` could be:
ja_jp: `Person` を使用する非常にシンプルな JAX-RS Resource は次のようになります:

source: A very simple Jakarta REST Resource that uses `Person` could be:
ja_jp: `Person` を使用する非常にシンプルな Jakarta REST Resource は次のようになります:

source: A very simple example is:
ja_jp: 以下に、非常に簡単な例を示します。

source: A very simple example usage looks like:
ja_jp: 非常にシンプルな使用例は、次のようになります:

source: A very simple text template:
ja_jp: 非常にシンプルなテキストテンプレート:

source: A very useful pattern of creating such beans but also giving application code the ability to easily override some beans with custom implementations, is to use the `@DefaultBean` that Quarkus provides. This is best explained with an example.
ja_jp: このような Bean を作成しつつ、アプリケーションコードにカスタム実装で Bean の一部を簡単にオーバーライドする機能を与えるという非常に便利なパターンは、Quarkus が提供している `@DefaultBean` を使用することです。これは例を挙げて説明するのが一番です。

source: A very useful pattern of creating such beans but also giving application code the ability to easily override some of the beans with custom implementations, is to use the `@DefaultBean` that Quarkus provides. This is best explained with an example.
ja_jp: このような Bean を作成しつつ、アプリケーションコードにカスタム実装で Bean の一部を簡単にオーバーライドする機能を与えるという非常に便利なパターンは、Quarkusが提供している `@DefaultBean` を使用することです。これは例を挙げて説明するのが一番です。

source: A virtual (and in person where possible) tour of Java User Groups creating a unique hands-on experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world.
ja_jp: Java User Groupsのバーチャルツアーでは、Kubernetesの世界でJavaを使い始めるのに役立つように設計されたQuarkusの専門家にアクセスできるユニークなハンズオン体験を作成しています。

source: A virtual method is a *part of an expression* that looks like a regular Java method invocation. It's called "virtual" because it does not have to match the actual method of a Java class. In fact, like normal properties a virtual method is also handled by a value resolver. The only difference is that for virtual methods a value resolver consumes parameters that are also expressions.
ja_jp: 仮想メソッドとは、通常のJavaメソッド呼び出しのように見える *式のパーツ* です。Javaクラスの実際のメソッドと一致する必要がないため、「仮想」と呼ばれています。実際には、通常のプロパティーと同様に、仮想メソッドも値リゾルバによって処理されます。唯一の違いは、仮想メソッドの場合、値リゾルバが式でもあるパラメーターを消費することです。

source: A virtual method with single parameter can be called using the infix notation:
ja_jp: 単一のパラメーターを持つ仮想メソッドは 中置記法を使用して呼び出すことができます。

source: A vivid community, which listens actively for feedback, and welcome contributions
ja_jp: 積極的にフィードバックに耳を傾け、貢献を歓迎する生き生きとしたコミュニティ

source: A warning message is logged for each _unused_ parameter.
ja_jp: _未使用の_ パラメーターごとに警告メッセージが記録されます。

source: A web-based user interface, shown in Figure 1, allows superheroes to fight against supervillains. Previous fight outcomes are also shown on this page.
ja_jp: 図1に示すWebベースのユーザーインターフェースで、スーパーヒーローがスーパーヴィランと戦うことができます。過去の戦いの結果もこのページに表示されます。
